<h2>This NoteBook is Part 1 of studying Pandas Library and improving skills</h2>

<h4>In Part 1</h4>

- Importing a Dataset
- Manipulating a Dataframe
- Counting Values in a Series
- Filtering a Column by One or More Criteria
- Grouping Data

In [1]:
#Import Numpy and Panda Libraries
import numpy as np
import pandas as pd

In [2]:
#Import the dataset
url = "https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_01_introducing_pandas/movies.csv"
df = pd.read_csv(url)

In [3]:
df.head()

   Rank                         Title       Studio       Gross  Year
0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
1     2                        Avatar          Fox  $2,789.70   2009
2     3                       Titanic    Paramount  $2,187.50   1997
3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018

In [12]:
#Instead of autoindex, can preset index values
df = pd.read_csv(url, index_col="Title")

In [13]:
#To Count Number of Rows
print(len(df))

#To Print number of rows and columns
print(df.shape)

782
(782, 4)

In [14]:
#To view the type of data within the dataframe
df.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [15]:
#To extract a row by its index position, use .iloc[#]
df.iloc[499]

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [17]:
#Can Also use index label to access the row
df.loc["Forrest Gump"]

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [19]:
#Dataframe is auto sorted (by Rank for this dataset)
#Can resort, or view in particular order
df.sort_values(by="Year",ascending=False).head() #False to make is descending

                                            Rank  ...  Year
Title                                             ...
Avengers: Endgame                              1  ...  2019
John Wick: Chapter 3 - Parabellum            458  ...  2019
The Wandering Earth                          114  ...  2019
Toy Story 4                                  198  ...  2019
How to Train Your Dragon: The Hidden World   199  ...  2019

[5 rows x 4 columns]

In [20]:
#Can also Sort by multiple values
df.sort_values(by=["Studio","Year"]).head()

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [22]:
#Can also sort by index, which can alphabetize
df.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

<h4>Counting Values in a Series

In [26]:
#To Answer a question like
#"Which movie studio had the greatest number of highest-grossing films?"
df["Studio"].value_counts().head(10) #Returns Top 10 Grossing Studios as Series

Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
TriStar             11
Name: Studio, dtype: int64

<h4>Filtering a Column by One or More Criteria

In [29]:
#To limit view to a particular studio
#dataframe[dataframe["Column_Name"] == "Value_Name"]
df[df["Studio"] == "Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [31]:
#Can also assign the results(a series object) to a variable
universal_studio = df[df["Studio"] == "Universal"]
universal_studio

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [34]:
#Can Also Combine Multiple Criterias
#Use individual criterias to find movies produced by Universal Studios in 2015
universal_studio = df["Studio"] == "Universal"
released_2015 = df["Year"] == 2015
df[universal_studio & released_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [35]:
#Can also filter by contained strings
#first convert string values to lowercase and contains value
dark_in_title = df.index.str.lower().str.contains("dark")
df[dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

<h4> Grouping Data

In [36]:
#Next we can group values to its aggregate and perform statistical analysis

In [37]:
#First we need to convert the Gross column from object to int
#Remove the Dollar sign and the comma, then convert to float
#And then assign it to the Gross column to mutate it

df["Gross"] = df["Gross"].str.replace("$", "").str.replace(",", "").astype(float)

In [38]:
df["Gross"]

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [41]:
#Now that the column has been converted to numeric values
#We can Perform some statistical analysis measures

#First we can find the average(mean) Grossing value
df["Gross"].mean()

439.0308184143226

In [42]:
#Now to find the aggregates use the .groupby() function
#First assign a grouped series to a variable
studios = df.groupby("Studio")

In [43]:
#Then to find the total gross of each studio 
studios['Gross'].sum().head()

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64

In [45]:
#To view in sorted order, with highest first
studios["Gross"].sum().sort_values(ascending=False).head()

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64